# -*- coding: utf-8 -*-
from sklearn.metrics.pairwise import cosine_similarity
import pickle
import json
import pandas as pd
import pdb
import configparser
import time
import os


# 아이템 간의 유사도 행렬을 계산하고 저장하는 함수
def calculate_and_save_similarity_matrix(data):
    # 데이터를 아이템-사용자 행렬로 변환
    item_user_matrix = data.explode('movingPath').pivot_table(index='movingPath', columns='session_id', aggfunc=lambda x: 1).fillna(0)

    # 코사인 유사도 행렬 계산
    similarity_matrix = cosine_similarity(item_user_matrix)

    # 유사도 행렬을 파일로 저장
    with open('models/similarity_matrix/sim_mat_{}.pkl'.format(time.strftime('%y%m%d')), 'wb') as f: #파일명에 시간도 추가하고싶으면 %y%m%d%X
        pickle.dump(similarity_matrix, f)
        
        
        
tempdf = pd.read_csv('output_201906to09.csv', header=0)

# 'data' 열의 JSON 파싱
tempdf['data'] = tempdf['data'].str.replace("\\", "\\\\")

tempdf['data'] = tempdf['data'].str.replace("'", '"')
parsed_data = tempdf['data'].apply(json.loads)
df = pd.json_normalize(parsed_data)

#문자 통일 및 리스트 변환
df['movingPath'] = df['movingPath'].apply(lambda x: x.replace('->', '|'))
df['movingPath'] = df['movingPath'].apply(lambda x: x.replace(',', '|'))  #
df['movingPath'] = df['movingPath'].apply(lambda x: x.replace('-', '|'))
df['movingPath'] = df['movingPath'].apply(lambda x: x.replace('/', '|'))
df['movingPath'] = df['movingPath'].apply(lambda x: x.split('|'))


# 원하는 아이템들만을 포함하는 리스트
include_keywords = ['용담레포츠공원', '칠십리공원', '사라봉공원', '수운근린공원', '삼무공원', '걸매생태공원', '천지연폭포', '너븐숭이4.3기념관', '한라수목원', '천지연폭포', '산악박물관(관음사)', '용두암', '절물자연휴양림', '관음사(야영장)', '광치기해변', '공천포 포구', '서빈백사해수욕장', '광치기해변', '우도한반도여 입구해변', '신양연안바다목장', '종달리해변', '검멀레해수욕장', '6코스', '9코스', '19코스', '4코스', '5코스', '6코스', '10-1코스', '20코스', '19코스', '6코스', '제주동문시장', '모슬포중앙시장', '제주민속오일장', '한라산국립공원_윗세오름대피소', '한라산국립공원_진달래밭대피소', '한라산국립공원_백록담', '한라생태숲', '서귀포 치유의 숲', '사려니숲길', '한라생태숲', '용담해안 카페촌거리', '아랑조을거리', '칠성로 쇼핑거리', '탑동 테마거리', '종달리수국길', '국수문화거리', '누웨모루거리(구 바오젠거리)', '솔동산 문화의 거리', '해변공연장', '기당미술관', '추자도 대서리 문화공연장', '칠십리야외공연장', '해변공연장', '서광동리마을공연장', '갤러리둘하나', '왈종미술관', '기당미술관','17코스', '한라수목원', '인다마을', '삼무공원', '문화예술의거리', '흑돼지거리','모슬포중앙시장', '동문시장','칠성로쇼핑거리', '탑동테마거리','애월해안로', '16코스', '문예회관(전기차)', '제주항연안여객터미널', '탑동입구', '영화의거리', '산지천', '문예회관','남서광마을', '용담해안카페촌거리', '국수문화거리', '서문가구거리','삼성혈문화의거리', '삼성혈','광치기해변','신양섭지코지해변', '아쿠아플라넷','항몽유적지', '제주장미불빛축제','신산공원', '천지연폭포', '새연교', '솔동산문화의거리','서귀포자연휴양림(관리동랙)', '서귀포자연휴양림(동백동)', '서귀포자연휴양림(녹나무동)', '돈내코', '포니벨리','하효쇠소깍해변', 'KT성산포지점', '섭지코지', '올인하우스', '월정리해변','케이티앤지', '유리의성', '서부농업기술센터', '14코스', '카멜리아힐', '함덕서우봉해변', '중앙로사거리','원노형', '세리월드_동화속미로공원', '월드컵경기장대도로변입구매표소', '용문사거리', '문화의거리', '삼양1동','용문마을(서)', '제주목관아', '제주국제공항', '우도', '서빈백사해수욕장', '하우목동항', '성산포항','천진항(소라축제장)', '하고수동해수욕장', '검멀레해수욕장', '롯데마트', '용연,용두암', '용담공원','서문시장', '한림공원(협재․쌍용굴)', '협재해변', '천지동자원순환센터', '천지연공영주차장', '제주공룡랜드','중문관광단지', '헬로키티아일랜드', '노형제2근린공원', '서사라문화거리','천진항(마을정보센타)', '우도면복지회관앞', '우도봉입구','돌칸이해변', '망루등대', '칠십리음식특화거리','거로마을', '산방산', '산방산(용머리,하멜상선)', '사계해변', '제주월드컵경기장서귀포버스터미널', '문화공원','서귀포시외버스터미날', '동광R주차장', '제주서커스월드', '토이파크', '그리스신화박물관','제주민속오일장', '수운근린공원', '곽지과물해변', '한담해변', '사라봉오거리','금능으뜸원해변', '한림종합운동장', 'GS25너울빌리지점', '판포해변(포구)','아랑조을거리공영주차장', '1코스', '세계조가비박물관', '만장굴', '김녕미로공원','일도이동공영주차장', '절물자연휴양림', '신제주로터리', '남서광마을입구(남)', '중문관광단지입구(남)','테디베어뮤지엄', '믿거나말거나박물관', '플레이케이팝제주', '천제연폭포', '중문·색달해변', '회수사거리','비체올린', '중문랜드', '칠십리공원_A', '서귀포시민회관', '천지동아랑조을거리','정방폭포', '13코스', '노형근린공원', '비자림', '7코스','걸매생태공원', '비석거리', '제주시평생학습센터', '서귀포전천후게이트볼장', '제주조랑말타운', '성읍랜드','종합경기장(광장제외)', '약천사', '화북남문', '제주미니미니랜드', '외돌개', '성산일출해양도립공원','표선해수욕장주차장', '신비의도로(도깨비도로)', '한라산국립공원', '8코스','주상절리대(제1매표소)', '주상절리대', '함덕비석거리(남)','사라봉공원(모충사)', '제주항국제여객터미널', '도남공원', '제주러브랜드','GS25서광점', '소인국테마파크', '빅볼랜드', '용담레포츠공원', 'GS25중문사거리점', '표선해비치해변','제주민속촌', '제주종합경기장', '이호테우해변', '성읍민속마을', '성읍관리실', '종탑', '김창열미술관','방림원', '현대미술관', '삼양검은모래해변', '18코스', '동산교','서귀포매일올레시장', '중앙공원', '운진항', '사계해안도로', '서귀포예술의전당', '용담사거리', '서복전시관','세계성문화박물관(2층)', '워터월드', '세화해변', '세화오일장인근주차장', '제주도의회', '매일올레시장주차장','송악산', '에코랜드테마파크', '오일시장일대공영주차장', '안덕계곡주차장', '1코스시작점', '하도해변','해녀박물관', '20코스', '김녕성세기해변', '바오젠거리','19코스', '더마파크', '2코스', '외도구획정리지구', '10', '사라봉공원(충혼각)','21코스', '동미빌딩', '중앙로터리', '기당미술관', '성산포수협표선지점', '모구리야영장','마라해양도립공원', '우령이마을', '한마음공원', '노형제1근린공원', '강창학경기장', '강창학B구장','코코몽주차장', '봉개동(버스)', '종달리해변', '청소년문화의집(북)', '수월봉', '노루생태공원','한라생태숲',  '민속자연사박물관', '추사적거지', '아모렉스리조트', '이중섭거리', '제주추사관', '이도공원', '번개과학체험관','황금륭골든힐허브팜', '5코스', '일출랜드', '안덕계곡', '9코스', '제주민속박물관', '월평마을','갓전시관', '교래자연휴양림', '메이즈랜드', '다이나믹메이즈', '이상한나라의앨리스','서귀포성당뒤주차장(솔동산로근처)', '소암현중화기념관', 'GS25대포점', '조안베어박물관', '서귀포시궁도장','서귀포롤러스케이트장', '15코스', '생각하는정원', '남원읍공영주차장', '블루마운틴커피테마파크','서귀포자기주도학습지원센터', '예래생태체험관', '상효원', '11코스', '서귀포시립이중섭미술관','화순금모래해변', '삼양동선사유적', '신재생에너지관', '관음사휴게소', '도두봉공원', '시민복지타운근린공원','제주레일바이크', '혼인지', '수목원테마파크', '제주돌문화공원', '선녀와나무꾼테마공원', '성산읍공영주차장','해양경비안전센터(고산출장소)', '제주도립미술관', '세계자동차박물관', '제주4․3평화공원', '아프리카박물관','큰엉(남원관광지구)', '보목하수처리장', '국립제주박물관', '제주해녀박물관', '제주농업기술센터', '대유산업','수운공원', '백년초박물관', '양지공원', '환상숲', '한국야구명예전당', '환경성질환예방관리센터','제주유리박물관', '사라봉공원', '대정영어교육도시', '월령포구', '무릉문화의집', '석굴암', '천왕사숲길','서귀포감귤박물관', '제주세계자연유산센터', '제주허브동산','제주옹기박물관', '붉은오름자연휴양림', '교육박물관', '전쟁역사박물관(구,평화박물관)', '알프스얼음보석궁전','제주돌마을공원', '서귀포치유의숲', '별빛누리공원(전기차)', '제주별빛누리공원', '노루생태관찰원','노리매(매화테마공원)', '방일리공원', '휴애리(생활공원)', '국제평화센터', '화순곶자왈생태탐방숲길','엉또폭포', '전지훈련장', '제주한란전시관', '그레이스호텔', '제주시자치경찰단', '영화문화예술센터','서귀포천문과학문화관', '무오법정사', '항일기념관', '제주다원', '선흘곶자왈생태숲','북촌돌하르방공원', '한울랜드(화석.연박물관)', '건강과성박물관', '제주공룡휴게소박물관', '금산공원','베니스랜드', '세계술박물관', '화북휴먼시아(화북4상가)',  '광양', '자연사랑갤러리']

temp = df.copy()

# movingPath에서 include_keywords에 포함된 아이템만 남김
temp['movingPath'] = temp['movingPath'].apply(lambda path: [item for item in path if item in include_keywords])
temp = temp[temp['movingPath'].apply(lambda path: 3 <= len(path) <= 15)]
temp = temp.reset_index(names='session_id')


# temp=df.copy()
# # temp=temp[(temp['pathSize']>=5) & (temp['pathSize']<=17)]
#
# exclude_keywords = ['학교', '주민센터', '은행', '병원', '아파트', '금고', '도서관', '체육','서귀포시자기주도학습지원센터','119','보건소', '우체국', '도청', '법원', '사무소','복지관', '시청', '대학','산부인과']
# temp['movingPath'] = temp['movingPath'].apply(lambda i: [item.replace(' ','') for item in i])
# temp['movingPath'] = temp['movingPath'].apply(lambda x: ' '.join(x))
# temp['remove'] = temp['movingPath'].apply(lambda x: 0 if all(keyword not in x for keyword in exclude_keywords) else 1)
# temp['movingPath'] =temp['movingPath'].apply(lambda x: x.split())
# new = temp[temp['remove'] == 0]
#
# exclude_keywords = ['애월읍1','애월읍2','애월읍3','애월읍4','남원읍1','남원읍2','남원읍3','남원읍4',\
#                     '남원읍5','남원읍6','조천읍1','조천읍2','조천읍3','조천읍4','표선면1','표선면2','표선면3','표선면4',\
#                     '표선면5','표선면6','자치경찰단서귀포지역경찰대','성산읍1','성산읍2','성산읍3', '성산읍4', '성산읍5',\
#                     '대정읍1', '대정읍2', '대정읍3','구좌읍1','구좌읍2','구좌읍3','구좌읍4', '구좌읍5','은남동',
#                     '안덕면1','안덕면2','안덕면3','안덕면4','안덕면5','안덕면6','안덕면7','안덕면8','큰동네(버스)','월산마을','가로등']
#
# temp = new.copy()
# temp['movingPath'] = temp['movingPath'].apply(lambda path: [item for item in path if all(keyword not in item for keyword in exclude_keywords)])
# temp = temp[temp['movingPath'].apply(lambda path: 6 <= len(path) <= 15)]
temp = temp.reset_index()

data = temp.copy()
# print(data['movingPath'].head())
ibcf_df = data.loc[:, ['session_id', 'movingPath']]


# new['visitedPlaces'] = new['movingPath'].apply(lambda x: x[:-2])                   

                    
###

#사용자 - 아이템 행렬을 만들고, 사용자 벡터별 코사인 유사도 기반으로 아이템 유사도 행렬 만들어 저장
os.system("mkdir -p models/similarity_matrix")
calculate_and_save_similarity_matrix(ibcf_df)

#행렬 생성시 사용한 데이터만을 저장
os.system("mkdir -p models/data")
data.to_csv('models/data/filtered_data_{}.csv'.format(time.strftime('%y%m%d')), index=False)
