import numpy as np
import streamlit as st
import joblib
import os


def run_rec_alg():
    st.title("추천 페이지")
    col1, col2 = st.columns(2)
    with col1:
        st.subheader("이전 여행지를 골라주세요")
        wifi_list = ['17코스(광령1리', '외도', '이호', '용두암', '산지천)', '롯데리아제주외도DT', '고마로거리',
       '한라수목원', '인다마을', '삼무공원', '문화예술의거리', '설문대여성문화센터', '흑돼지거리',
       '대정감협인근공영주차장', '모슬포중앙시장', '하모3리', '동문로터리', '동문시장',
       '칠성로쇼핑거리', '지하상가', '탑동테마거리', '중앙로', '애월해안로', '16코스(고내포구', '항파두리',
       '광령1리)', '문예회관(전기차)', '제주항연안여객터미널', '탑동입구', '영화의거리', '산지천', '문예회관',
       '남서광마을', '용담해안카페촌거리', '정부제주지방합동청사', '시민회관', '국수문화거리', '서문가구거리',
       '삼성혈문화의거리', '삼성혈인근공영주차장', '삼성혈', '3', '제주시민회관', '광치기해변',
       '신양섭지코지해변', '아쿠아플라넷', '인화동', '정존마을', '항몽유적지', '제주장미불빛축제', '노형오거리',
       '신산공원', '서귀포시구버스터미널', '천지연폭포', '새연교', '새연교안내소', '솔동산문화의거리',
       '서귀포자연휴양림(관리동랙)', '서귀포자연휴양림(동백동)', '서귀포자연휴양림(녹나무동)', '돈내코', '포니벨리',
       '서부두명품회집거리', '하효쇠소깍해변', 'KT성산포지점', '섭지코지', '올인하우스', '월정리해변',
       '케이티앤지', '유리의성', '서부농업기술센터', '14코스', '카멜리아힐', '함덕서우봉해변', '중앙로사거리',
       '원노형', '세리월드_동화속미로공원', '월드컵경기장대도로변입구매표소', '용문사거리', '문화의거리', '삼양1동',
       '용문마을(서)', '제주목관아', '제주국제공항', '우도', '서빈백사해수욕장', '하우목동항', '성산포항',
       '천진항(소라축제장)', '하고수동해수욕장', '검멀레해수욕장', '롯데마트', '용연,용두암', '용담공원',
       '서문시장', '한림공원(협재․쌍용굴)', '협재해변', '천지동자원순환센터', '천지연공영주차장', '제주공룡랜드',
       '중문관광단지', '헬로키티아일랜드', '노형제2근린공원', '용문마을회관(버스)', '서사라문화거리',
       '천진항(마을정보센타)', '우도면복지회관앞', '우도봉입구,돌칸이해변', '망루등대', '칠십리음식특화거리',
       '거로마을', '산방산', '산방산(용머리,하멜상선)', '사계해변', '제주월드컵경기장서귀포버스터미널', '문화공원',
       '서귀포시외버스터미날', '삼양2동', '동광R주차장', '제주서커스월드', '토이파크', '그리스신화박물관',
       '제주민속오일장', '수운근린공원', '곽지과물해변', '한담해변', '한담동(버스)남', '사라봉오거리',
       '금능으뜸원해변', '한림공원인근공영주차장', '한림종합운동장', 'GS25너울빌리지점', '판포해변(포구)',
       '아랑조을거리공영주차장', '7', '1코스', '세계조가비박물관', '만장굴', '김녕미로공원', '1', '2',
       '일도이동공영주차장', '절물자연휴양림', '신제주로터리', '남서광마을입구(남)', '중문관광단지입구(남)',
       '테디베어뮤지엄', '믿거나말거나박물관', '플레이케이팝제주', '천제연폭포', '중문·색달해변', '회수사거리',
       '중문동(남)', '비체올린', '중문랜드', '칠십리공원_A', '서귀포시민회관', '천지동아랑조을거리',
       '정방폭포(주차장)', '정방폭포', '13코스', '노형근린공원', '비자림', '7코스',
       '걸매생태공원', '비석거리', '제주시평생학습센터', '서귀포전천후게이트볼장', '제주조랑말타운', '성읍랜드',
       '종합경기장(광장제외)', '약천사', '화북남문', '제주미니미니랜드', '외돌개', '성산일출해양도립공원',
       '성산포항종합여객터미널(출발)', '표선해수욕장주차장', '신비의도로(도깨비도로)', '한라산국립공원', '8코스',
       '주상절리대(제1매표소)', '주상절리대', '함덕비석거리(남)', '함덕리(3구)(북)', '성판악휴게소',
       '효돈동2', '사라봉공원(모충사)', '제주항국제여객터미널', '도남공원', '제주러브랜드', '축산진흥원',
       'GS25서광점', '소인국테마파크', '빅볼랜드', '용담레포츠공원', 'GS25중문사거리점', '표선해비치해변',
       '제주민속촌', '제주종합경기장', '이호테우해변', '성읍민속마을', '성읍관리실', '종탑', '김창열미술관',
       '방림원', '현대미술관', '삼양검은모래해변', '18코스', '동산교', '서귀포농업기술센터',
       '서귀포매일올레시장', '중앙공원', '운진항', '사계해안도로', '서귀포예술의전당', '용담사거리', '서복전시관',
       '세계성문화박물관(2층)', '워터월드', '세화해변', '세화오일장인근주차장', '제주도의회', '매일올레시장주차장',
       '송악산', '에코랜드테마파크', '오일시장일대공영주차장', '안덕계곡주차장', '1코스시작점', '하도해변',
       '해녀박물관', '20코스', '김녕성세기해변', '함덕농협지소(북)', '시외버스터미널', '바오젠거리',
       '19코스', '더마파크', '성산하수처리장', '2코스', '외도구획정리지구', '10', '사라봉공원(충혼각)',
       '21코스', '동미빌딩', '중앙로터리', '기당미술관', '성산포수협표선지점', '모구리야영장',
       '마라해양도립공원', '우령이마을', '한마음공원', '노형제1근린공원', '강창학경기장', '강창학B구장',
       '코코몽주차장', '봉개동(버스)', '종달리해변', '청소년문화의집(북)', '수월봉', '노루생태공원',
       '한라생태숲',  '민속자연사박물관', '추사적거지', '아모렉스리조트', '이중섭거리', '제주추사관', '이도공원', '번개과학체험관',
       '황금륭골든힐허브팜', '5코스', '일출랜드', '안덕계곡', '9코스', '제주민속박물관', '월평마을',
       '갓전시관', '교래자연휴양림', '김정문화회관', '메이즈랜드', '다이나믹메이즈', '이상한나라의앨리스',
       '서귀포성당뒤주차장(솔동산로근처)', '소암현중화기념관', 'GS25대포점', '조안베어박물관', '서귀포시궁도장',
       '서귀포롤러스케이트장', '15코스', '생각하는정원', '남원읍공영주차장', '블루마운틴커피테마파크',
       '서귀포자기주도학습지원센터', '예래생태체험관', '상효원', '11코스', '서귀포시립이중섭미술관',
       '화순금모래해변', '삼양동선사유적', '신재생에너지관', '관음사휴게소', '도두봉공원', '시민복지타운근린공원',
       '제주레일바이크', '혼인지', '수목원테마파크', '제주돌문화공원', '선녀와나무꾼테마공원', '성산읍공영주차장',
       '해양경비안전센터(고산출장소)', '제주도립미술관', '세계자동차박물관', '제주4․3평화공원', '아프리카박물관',
       '큰엉(남원관광지구)', '보목하수처리장', '국립제주박물관', '제주해녀박물관', '제주농업기술센터', '대유산업',
       '수운공원', '백년초박물관', '양지공원', '환상숲', '한국야구명예전당', '환경성질환예방관리센터',
       '제주유리박물관', '사라봉공원', '대정영어교육도시', '월령포구', '무릉문화의집', '석굴암', '천왕사숲길',
       '서귀포감귤박물관', '제주도상하수도본부', '제주세계자연유산센터', '제주허브동산', '보건환경연구원',
       '제주옹기박물관', '붉은오름자연휴양림', '교육박물관', '전쟁역사박물관(구,평화박물관)', '알프스얼음보석궁전',
       '제주돌마을공원', '서귀포치유의숲', '별빛누리공원(전기차)', '제주별빛누리공원', '노루생태관찰원',
       '노리매(매화테마공원)', '방일리공원', '휴애리(생활공원)', '국제평화센터', '화순곶자왈생태탐방숲길',
       '엉또폭포', '전지훈련장', '제주한란전시관', '그레이스호텔', '제주시자치경찰단', '영화문화예술센터',
       '서귀포천문과학문화관', '무오법정사', '항일기념관', '제주다원', '제주공항입구공영주차장', '선흘곶자왈생태숲',
       '북촌돌하르방공원', '한울랜드(화석.연박물관)', '건강과성박물관', '제주공룡휴게소박물관', '금산공원',
       '베니스랜드', '세계술박물관', '화북휴먼시아(화북4상가)',  '광양', '자연사랑갤러리']
        history1 = st.selectbox("history1", wifi_list)
        history2 = st.selectbox("history2", wifi_list)
        history3 = st.selectbox("history3", wifi_list)
        history4 = st.selectbox("history4", wifi_list)
        history5 = st.selectbox("history5", wifi_list)
        history6 = st.selectbox("history6", wifi_list)
        hist = [history1, history2, history3, history4, history5, history6]
        st.write(hist)
        
    with col2:
        st.subheader("추천결과확인")
        
        MODEL_PATH='models/userCF_matrix.pkl'
        similarity_matrix = joblib.load(open(os.path.join(MODEL_PATH), 'rb'))
        
        new_user_vector = np.mean([model.wv[word] for word in hist if word in model.wv], axis=0)
        
        # 유사도 계산
        similarities = np.dot(similarity_matrix, new_user_vector)
        
        # 추천 목록 생성
        recommendations_indices = np.argsort(similarities)[::-1][1:21]  # 자기 자신을 제외한 상위 20개 추천
        recommended_places = [new['movingPath'][i] for i in recommendations_indices]
        
        st.write(recommended_places)
            
